In [1]:
import pandas as pd

In [2]:
import numpy as np

In [3]:
import matplotlib.pyplot as plt

In [4]:
s = pd.Series([1,3,5,np.nan,6,8])

In [5]:
dates = pd.date_range('20130101', periods=6)

In [6]:
dates

DatetimeIndex(['2013-01-01', '2013-01-02', '2013-01-03', '2013-01-04',
               '2013-01-05', '2013-01-06'],
              dtype='datetime64[ns]', freq='D')

In [7]:
df = pd.DataFrame(np.random.randn(6,4), index=dates, columns=list('ABCD'))

In [8]:
df

                   A         B         C         D
2013-01-01  0.555882 -0.832643 -0.296119 -1.145150
2013-01-02  1.285196  1.494385 -0.866372  0.000472
2013-01-03  0.242632  0.232423  0.027191 -2.233347
2013-01-04  0.227772 -1.207482  0.231856  0.160989
2013-01-05 -0.132987  0.423153  0.653331 -0.191321
2013-01-06 -2.620521  0.864522 -0.586016 -1.839089

In [9]:
df2 = pd.DataFrame({ 'A' : 1.,
                     'B' : pd.Timestamp('20130102'),
                     'C' : pd.Series(1,index=list(range(4)),dtype='float32'),
                     'D' : np.array([3] * 4,dtype='int32'),
                     'E' : pd.Categorical(["test","train","test","train"]),
                     'F' : 'foo' })

In [10]:
df2

   A          B  C  D      E    F
0  1 2013-01-02  1  3   test  foo
1  1 2013-01-02  1  3  train  foo
2  1 2013-01-02  1  3   test  foo
3  1 2013-01-02  1  3  train  foo

In [11]:
df2.dtypes

A           float64
B    datetime64[ns]
C           float32
D             int32
E          category
F            object
dtype: object

In [12]:
df.head()

                   A         B         C         D
2013-01-01  0.555882 -0.832643 -0.296119 -1.145150
2013-01-02  1.285196  1.494385 -0.866372  0.000472
2013-01-03  0.242632  0.232423  0.027191 -2.233347
2013-01-04  0.227772 -1.207482  0.231856  0.160989
2013-01-05 -0.132987  0.423153  0.653331 -0.191321

In [13]:
df.index

DatetimeIndex(['2013-01-01', '2013-01-02', '2013-01-03', '2013-01-04',
               '2013-01-05', '2013-01-06'],
              dtype='datetime64[ns]', freq='D')

In [14]:
df.columns

Index([u'A', u'B', u'C', u'D'], dtype='object')

In [15]:
df.values

array([[  5.55881947e-01,  -8.32643154e-01,  -2.96118594e-01,
         -1.14515006e+00],
       [  1.28519601e+00,   1.49438457e+00,  -8.66372003e-01,
          4.72036607e-04],
       [  2.42631697e-01,   2.32423204e-01,   2.71914960e-02,
         -2.23334695e+00],
       [  2.27772248e-01,  -1.20748184e+00,   2.31855965e-01,
          1.60988842e-01],
       [ -1.32986752e-01,   4.23153045e-01,   6.53330542e-01,
         -1.91321262e-01],
       [ -2.62052063e+00,   8.64521553e-01,  -5.86016111e-01,
         -1.83908885e+00]])

In [16]:
df.describe()

              A         B         C         D
count  6.000000  6.000000  6.000000  6.000000
mean  -0.073671  0.162393 -0.139355 -0.874574
std    1.335944  1.020465  0.556151  1.015352
min   -2.620521 -1.207482 -0.866372 -2.233347
25%   -0.042797 -0.566377 -0.513542 -1.665604
50%    0.235202  0.327788 -0.134464 -0.668236
75%    0.477569  0.754179  0.180690 -0.047476
max    1.285196  1.494385  0.653331  0.160989

In [17]:
df.T

   2013-01-01  2013-01-02  2013-01-03  2013-01-04  2013-01-05  2013-01-06
A    0.555882    1.285196    0.242632    0.227772   -0.132987   -2.620521
B   -0.832643    1.494385    0.232423   -1.207482    0.423153    0.864522
C   -0.296119   -0.866372    0.027191    0.231856    0.653331   -0.586016
D   -1.145150    0.000472   -2.233347    0.160989   -0.191321   -1.839089

In [18]:
df.sort_index(axis=1, ascending=False)

                   D         C         B         A
2013-01-01 -1.145150 -0.296119 -0.832643  0.555882
2013-01-02  0.000472 -0.866372  1.494385  1.285196
2013-01-03 -2.233347  0.027191  0.232423  0.242632
2013-01-04  0.160989  0.231856 -1.207482  0.227772
2013-01-05 -0.191321  0.653331  0.423153 -0.132987
2013-01-06 -1.839089 -0.586016  0.864522 -2.620521

In [19]:
df.sort_values(by='B')

                   A         B         C         D
2013-01-04  0.227772 -1.207482  0.231856  0.160989
2013-01-01  0.555882 -0.832643 -0.296119 -1.145150
2013-01-03  0.242632  0.232423  0.027191 -2.233347
2013-01-05 -0.132987  0.423153  0.653331 -0.191321
2013-01-06 -2.620521  0.864522 -0.586016 -1.839089
2013-01-02  1.285196  1.494385 -0.866372  0.000472

In [20]:
df['A'] #select a single column

2013-01-01    0.555882
2013-01-02    1.285196
2013-01-03    0.242632
2013-01-04    0.227772
2013-01-05   -0.132987
2013-01-06   -2.620521
Freq: D, Name: A, dtype: float64

In [21]:
df[0:3] #slices along the rows

                   A         B         C         D
2013-01-01  0.555882 -0.832643 -0.296119 -1.145150
2013-01-02  1.285196  1.494385 -0.866372  0.000472
2013-01-03  0.242632  0.232423  0.027191 -2.233347

In [22]:
df['20130102':'20130104'] #slices among rows again

                   A         B         C         D
2013-01-02  1.285196  1.494385 -0.866372  0.000472
2013-01-03  0.242632  0.232423  0.027191 -2.233347
2013-01-04  0.227772 -1.207482  0.231856  0.160989

In [23]:
df.loc[dates[0]] #selection by label

A    0.555882
B   -0.832643
C   -0.296119
D   -1.145150
Name: 2013-01-01 00:00:00, dtype: float64

In [24]:
df.loc[:,['A','B']] #electing on a multi-axis by label

                   A         B
2013-01-01  0.555882 -0.832643
2013-01-02  1.285196  1.494385
2013-01-03  0.242632  0.232423
2013-01-04  0.227772 -1.207482
2013-01-05 -0.132987  0.423153
2013-01-06 -2.620521  0.864522

In [25]:
df.loc['20130102':'20130104',['A','B']] #Showing label slicing, both endpoints are included

                   A         B
2013-01-02  1.285196  1.494385
2013-01-03  0.242632  0.232423
2013-01-04  0.227772 -1.207482

In [26]:
df.loc['20130102',['A','B']] #Reduction in the dimensions of the returned object

A    1.285196
B    1.494385
Name: 2013-01-02 00:00:00, dtype: float64

In [27]:
df.loc[dates[0],'A'] #for getting a scalar value

0.5558819473575024

In [28]:
df.at[dates[0],'A'] #For getting fast access to a scalar (equiv to the prior method)

0.5558819473575024

In [29]:
#selection by position
df.iloc[3] #Select via the position of the passed integers

A    0.227772
B   -1.207482
C    0.231856
D    0.160989
Name: 2013-01-04 00:00:00, dtype: float64

In [30]:
df.iloc[3:5,0:2] #By integer slices, acting similar to numpy/python

                   A         B
2013-01-04  0.227772 -1.207482
2013-01-05 -0.132987  0.423153

In [31]:
df.iloc[[1,2,4],[0,2]] #By lists of integer position locations, similar to the numpy/python style

                   A         C
2013-01-02  1.285196 -0.866372
2013-01-03  0.242632  0.027191
2013-01-05 -0.132987  0.653331

In [32]:
df.iloc[1:3,:] #For slicing rows explicitly

                   A         B         C         D
2013-01-02  1.285196  1.494385 -0.866372  0.000472
2013-01-03  0.242632  0.232423  0.027191 -2.233347

In [33]:
df.iloc[:,1:3] #For slicing columns explicitly

                   B         C
2013-01-01 -0.832643 -0.296119
2013-01-02  1.494385 -0.866372
2013-01-03  0.232423  0.027191
2013-01-04 -1.207482  0.231856
2013-01-05  0.423153  0.653331
2013-01-06  0.864522 -0.586016

In [34]:
df.iloc[1,1] #for getting a value explicitly

1.4943845681846073

In [35]:
df.iat[1,1] #For getting fast access to a scalar (equiv to the prior method)

1.4943845681846073

In [36]:
#boolean indexing
df[df.A > 0] #Using a single columnâ€™s values to select data.

                   A         B         C         D
2013-01-01  0.555882 -0.832643 -0.296119 -1.145150
2013-01-02  1.285196  1.494385 -0.866372  0.000472
2013-01-03  0.242632  0.232423  0.027191 -2.233347
2013-01-04  0.227772 -1.207482  0.231856  0.160989

In [37]:
df[df > 0] #a where operation for getting

                   A         B         C         D
2013-01-01  0.555882       NaN       NaN       NaN
2013-01-02  1.285196  1.494385       NaN  0.000472
2013-01-03  0.242632  0.232423  0.027191       NaN
2013-01-04  0.227772       NaN  0.231856  0.160989
2013-01-05       NaN  0.423153  0.653331       NaN
2013-01-06       NaN  0.864522       NaN       NaN

In [38]:
#Using the isin() method for filtering:
df2 = df.copy()
df2['E'] = ['one', 'one','two','three','four','three']
df2

                   A         B         C         D      E
2013-01-01  0.555882 -0.832643 -0.296119 -1.145150    one
2013-01-02  1.285196  1.494385 -0.866372  0.000472    one
2013-01-03  0.242632  0.232423  0.027191 -2.233347    two
2013-01-04  0.227772 -1.207482  0.231856  0.160989  three
2013-01-05 -0.132987  0.423153  0.653331 -0.191321   four
2013-01-06 -2.620521  0.864522 -0.586016 -1.839089  three

In [39]:
df2[df2['E'].isin(['two','four'])]

                   A         B         C         D     E
2013-01-03  0.242632  0.232423  0.027191 -2.233347   two
2013-01-05 -0.132987  0.423153  0.653331 -0.191321  four

In [40]:
#Setting a new column automatically aligns the data by the indexes
s1 = pd.Series([1,2,3,4,5,6], index=pd.date_range('20130102', periods=6))
s1

2013-01-02    1
2013-01-03    2
2013-01-04    3
2013-01-05    4
2013-01-06    5
2013-01-07    6
Freq: D, dtype: int64

In [41]:
df['F'] = s1
df

                   A         B         C         D   F
2013-01-01  0.555882 -0.832643 -0.296119 -1.145150 NaN
2013-01-02  1.285196  1.494385 -0.866372  0.000472   1
2013-01-03  0.242632  0.232423  0.027191 -2.233347   2
2013-01-04  0.227772 -1.207482  0.231856  0.160989   3
2013-01-05 -0.132987  0.423153  0.653331 -0.191321   4
2013-01-06 -2.620521  0.864522 -0.586016 -1.839089   5

In [42]:
#Setting values by label
df.at[dates[0],'A'] = 0
df

                   A         B         C         D   F
2013-01-01  0.000000 -0.832643 -0.296119 -1.145150 NaN
2013-01-02  1.285196  1.494385 -0.866372  0.000472   1
2013-01-03  0.242632  0.232423  0.027191 -2.233347   2
2013-01-04  0.227772 -1.207482  0.231856  0.160989   3
2013-01-05 -0.132987  0.423153  0.653331 -0.191321   4
2013-01-06 -2.620521  0.864522 -0.586016 -1.839089   5

In [43]:
#Setting values by position
df.iat[0,1] = 0
df

                   A         B         C         D   F
2013-01-01  0.000000  0.000000 -0.296119 -1.145150 NaN
2013-01-02  1.285196  1.494385 -0.866372  0.000472   1
2013-01-03  0.242632  0.232423  0.027191 -2.233347   2
2013-01-04  0.227772 -1.207482  0.231856  0.160989   3
2013-01-05 -0.132987  0.423153  0.653331 -0.191321   4
2013-01-06 -2.620521  0.864522 -0.586016 -1.839089   5

In [44]:
#Setting by assigning with a numpy array
df.loc[:,'D'] = np.array([5] * len(df))
df

                   A         B         C  D   F
2013-01-01  0.000000  0.000000 -0.296119  5 NaN
2013-01-02  1.285196  1.494385 -0.866372  5   1
2013-01-03  0.242632  0.232423  0.027191  5   2
2013-01-04  0.227772 -1.207482  0.231856  5   3
2013-01-05 -0.132987  0.423153  0.653331  5   4
2013-01-06 -2.620521  0.864522 -0.586016  5   5

In [45]:
#A where operation with setting.
df2 = df.copy()
df2

                   A         B         C  D   F
2013-01-01  0.000000  0.000000 -0.296119  5 NaN
2013-01-02  1.285196  1.494385 -0.866372  5   1
2013-01-03  0.242632  0.232423  0.027191  5   2
2013-01-04  0.227772 -1.207482  0.231856  5   3
2013-01-05 -0.132987  0.423153  0.653331  5   4
2013-01-06 -2.620521  0.864522 -0.586016  5   5

df2[df2 > 0] = -df2
df2

In [46]:
#missing data
df1 = df.reindex(index=dates[0:4], columns=list(df.columns) + ['E'])
df1.loc[dates[0]:dates[1],'E'] = 1
df1

                   A         B         C  D   F   E
2013-01-01  0.000000  0.000000 -0.296119  5 NaN   1
2013-01-02  1.285196  1.494385 -0.866372  5   1   1
2013-01-03  0.242632  0.232423  0.027191  5   2 NaN
2013-01-04  0.227772 -1.207482  0.231856  5   3 NaN

In [47]:
#To drop any rows that have missing data.
df1.dropna(how='any') #all that's left is this one row

                   A         B         C  D  F  E
2013-01-02  1.285196  1.494385 -0.866372  5  1  1

In [48]:
#Filling missing data
df1.fillna(value=5)

                   A         B         C  D  F  E
2013-01-01  0.000000  0.000000 -0.296119  5  5  1
2013-01-02  1.285196  1.494385 -0.866372  5  1  1
2013-01-03  0.242632  0.232423  0.027191  5  2  5
2013-01-04  0.227772 -1.207482  0.231856  5  3  5

In [49]:
#To get the boolean mask where values are nan
pd.isnull(df1)

                A      B      C      D      F      E
2013-01-01  False  False  False  False   True  False
2013-01-02  False  False  False  False  False  False
2013-01-03  False  False  False  False  False   True
2013-01-04  False  False  False  False  False   True

In [50]:
#operations

In [51]:
#stats
df.mean() #Operations in general exclude missing data.

A   -0.166318
B    0.301167
C   -0.139355
D    5.000000
F    3.000000
dtype: float64

In [52]:
#Same operation on the other axis
df.mean(1)

2013-01-01    1.175970
2013-01-02    1.582642
2013-01-03    1.500449
2013-01-04    1.450429
2013-01-05    1.988699
2013-01-06    1.531597
Freq: D, dtype: float64

In [53]:
#Operating with objects that have different dimensionality and need alignment.
#In addition, pandas automatically broadcasts along the specified dimension.
s = pd.Series([1,3,5,np.nan,6,8], index=dates).shift(2)
s

2013-01-01   NaN
2013-01-02   NaN
2013-01-03     1
2013-01-04     3
2013-01-05     5
2013-01-06   NaN
Freq: D, dtype: float64

In [54]:
df.sub(s, axis='index')

                   A         B         C   D   F
2013-01-01       NaN       NaN       NaN NaN NaN
2013-01-02       NaN       NaN       NaN NaN NaN
2013-01-03 -0.757368 -0.767577 -0.972809   4   1
2013-01-04 -2.772228 -4.207482 -2.768144   2   0
2013-01-05 -5.132987 -4.576847 -4.346669   0  -1
2013-01-06       NaN       NaN       NaN NaN NaN

In [55]:
#apply functions to data

In [60]:
df.apply(np.cumsum)

                   A         B         C   D   F
2013-01-01  0.000000  0.000000 -0.296119   5 NaN
2013-01-02  1.285196  1.494385 -1.162491  10   1
2013-01-03  1.527828  1.726808 -1.135299  15   3
2013-01-04  1.755600  0.519326 -0.903443  20   6
2013-01-05  1.622613  0.942479 -0.250113  25  10
2013-01-06 -0.997907  1.807001 -0.836129  30  15

In [61]:
df.apply(lambda x: x.max() - x.min())

A    3.905717
B    2.701866
C    1.519703
D    0.000000
F    4.000000
dtype: float64

In [64]:
#histogramming
s = pd.Series(np.random.randint(0, 7, size=10))
s

0    5
1    5
2    5
3    3
4    4
5    5
6    0
7    5
8    5
9    6
dtype: int32

In [65]:
s.value_counts()

5    6
6    1
4    1
3    1
0    1
dtype: int64

In [69]:
#string methods
s = pd.Series(['A', 'B', 'C', 'Aaba', 'Baca', np.nan, 'CABA', 'dog', 'cat'])
s.str.lower()

0       a
1       b
2       c
3    aaba
4    baca
5     NaN
6    caba
7     dog
8     cat
dtype: object

In [71]:
#Concatenating pandas objects together with concat()
df = pd.DataFrame(np.random.randn(10, 4))
df

          0         1         2         3
0  1.668059  1.668676  0.754690 -1.799477
1  0.435217  1.364643 -0.817858 -0.586990
2  1.744720  0.705943  1.379470  1.233222
3  0.528955 -0.044006  0.055268  1.853668
4  0.732802 -0.859160 -1.400394  1.206224
5  0.102242  1.652888  0.525489 -0.516671
6 -0.105032  1.425761  0.079476  0.170922
7 -1.214608  0.820636  0.453492 -1.229210
8 -0.207602  1.101584 -0.108526  0.722798
9 -0.067205 -0.307294 -0.731083  0.251676

In [75]:
#break it into pieces
pieces = [df[:3], df[3:7], df[7:]]

In [76]:
df[:3] #rows 0 - 2

          0         1         2         3
0  1.668059  1.668676  0.754690 -1.799477
1  0.435217  1.364643 -0.817858 -0.586990
2  1.744720  0.705943  1.379470  1.233222

In [77]:
df[3:7] #rows 3-6

          0         1         2         3
3  0.528955 -0.044006  0.055268  1.853668
4  0.732802 -0.859160 -1.400394  1.206224
5  0.102242  1.652888  0.525489 -0.516671
6 -0.105032  1.425761  0.079476  0.170922

In [78]:
df[7:] #rows 7: last row

          0         1         2         3
7 -1.214608  0.820636  0.453492 -1.229210
8 -0.207602  1.101584 -0.108526  0.722798
9 -0.067205 -0.307294 -0.731083  0.251676

In [79]:
#put it back together
pd.concat(pieces)

          0         1         2         3
0  1.668059  1.668676  0.754690 -1.799477
1  0.435217  1.364643 -0.817858 -0.586990
2  1.744720  0.705943  1.379470  1.233222
3  0.528955 -0.044006  0.055268  1.853668
4  0.732802 -0.859160 -1.400394  1.206224
5  0.102242  1.652888  0.525489 -0.516671
6 -0.105032  1.425761  0.079476  0.170922
7 -1.214608  0.820636  0.453492 -1.229210
8 -0.207602  1.101584 -0.108526  0.722798
9 -0.067205 -0.307294 -0.731083  0.251676

In [80]:
#join (sql - style merges)